---
type: PointRelativeToPoint
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# PointRelativeToPoint

`Autodesk.Revit.DB.PointRelativeToPoint` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetHostPointReference | 2013 | `public Reference GetHostPointReference ()` |
| Method | SetHostPointReference | 2013 | `public void SetHostPointReference ( Reference hostPointReference )` |